/* errAuthorizationInvalidSet */
"-60001" = "The authorization rights are invalid.";

/* errAuthorizationInvalidRef */
"-60002" = "The authorization reference is invalid.";

/* errAuthorizationInvalidTag */
"-60003" = "The authorization tag is invalid.";

/* errAuthorizationInvalidPointer */
"-60004" = "The returned authorization is invalid.";

/* errAuthorizationDenied */
"-60005" = "The authorization was denied.";

/* errAuthorizationCanceled */
"-60006" = "The authorization was cancelled by the user.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "The authorization was denied since no user interaction was possible.";

/* errAuthorizationInternal */
"-60008" = "Unable to obtain authorization for this operation.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "The authorization is not allowed to be converted to an external format.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "The authorization is not allowed to be created from an external format.";

/* errAuthorizationInvalidFlags */
"-60011" = "The provided option flag(s) are invalid for this authorization operation.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "The specified program could not be executed.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "An invalid status was returned during execution of a privileged tool.";

/* errAuthorizationBadAddress */
"-60033" = "The requested socket address is invalid (must be 0-1023 inclusive).";

/* errSSLProtocol */
"-9800" = "SSL protocol error";

/* errSSLNegotiation */
"-9801" = "Cipher Suite negotiation failure";

/* errSSLFatalAlert */
"-9802" = "Fatal alert";

/* errSSLWouldBlock */
"-9803" = "I/O would block (not fatal)";

/* errSSLSessionNotFound */
"-9804" = "attempt to restore an unknown session";

/* errSSLClosedGraceful */
"-9805" = "connection closed gracefully";

/* errSSLClosedAbort */
"-9806" = "connection closed via error";

/* errSSLXCertChainInvalid */
"-9807" = "invalid certificate chain";

/* errSSLBadCert */
"-9808" = "bad certificate format";

/* errSSLCrypto */
"-9809" = "underlying cryptographic error";

/* errSSLInternal */
"-9810" = "Internal error";

/* errSSLModuleAttach */
"-9811" = "module attach failure";

/* errSSLUnknownRootCert */
"-9812" = "valid cert chain, untrusted root";

/* errSSLNoRootCert */
"-9813" = "cert chain not verified by root";

/* errSSLCertExpired */
"-9814" = "chain had an expired cert";

/* errSSLCertNotYetValid */
"-9815" = "chain had a cert not yet valid";

/* errSSLClosedNoNotify */
"-9816" = "server closed session with no notification";

/* errSSLBufferOverflow */
"-9817" = "insufficient buffer provided";

/* errSSLBadCipherSuite */
"-9818" = "bad SSLCipherSuite";

/* errSSLPeerUnexpectedMsg */
"-9819" = "unexpected message received";

/* errSSLPeerBadRecordMac */
"-9820" = "bad MAC";

/* errSSLPeerDecryptionFail */
"-9821" = "decryption failed";

/* errSSLPeerRecordOverflow */
"-9822" = "record overflow";

/* errSSLPeerDecompressFail */
"-9823" = "decompression failure";

/* errSSLPeerHandshakeFail */
"-9824" = "handshake failure";

/* errSSLPeerBadCert */
"-9825" = "misc. bad certificate";

/* errSSLPeerUnsupportedCert */
"-9826" = "bad unsupported cert format";

/* errSSLPeerCertRevoked */
"-9827" = "certificate revoked";

/* errSSLPeerCertExpired */
"-9828" = "certificate expired";

/* errSSLPeerCertUnknown */
"-9829" = "unknown certificate";

/* errSSLIllegalParam */
"-9830" = "illegal parameter";

/* errSSLPeerUnknownCA */
"-9831" = "unknown Cert Authority";

/* errSSLPeerAccessDenied */
"-9832" = "access denied";

/* errSSLPeerDecodeError */
"-9833" = "decoding error";

/* errSSLPeerDecryptError */
"-9834" = "decryption error";

/* errSSLPeerExportRestriction */
"-9835" = "export restriction";

/* errSSLPeerProtocolVersion */
"-9836" = "bad protocol version";

/* errSSLPeerInsufficientSecurity */
"-9837" = "insufficient security";

/* errSSLPeerInternalError */
"-9838" = "internal error";

/* errSSLPeerUserCancelled */
"-9839" = "user canceled";

/* errSSLPeerNoRenegotiation */
"-9840" = "no renegotiation allowed";

/* errSSLServerAuthCompleted */
"-9841" = "server cert is valid, or was ignored if verification disabled";

/* errSSLClientCertRequested */
"-9842" = "server has requested a client cert";

/* errSSLHostNameMismatch */
"-9843" = "peer host name mismatch";

/* errSSLConnectionRefused */
"-9844" = "peer dropped connection before responding";

/* errSSLDecryptionFail */
"-9845" = "decryption failure";

/* errSSLBadRecordMac */
"-9846" = "bad MAC";

/* errSSLRecordOverflow */
"-9847" = "record overflow";

/* errSSLBadConfiguration */
"-9848" = "configuration error";

/* errSecSuccess */
"0" = "No error.";

/* errSecUnimplemented */
"-4" = "Function or operation not implemented.";

/* errSecParam */
"-50" = "One or more parameters passed to a function were not valid.";

/* errSecAllocate */
"-108" = "Failed to allocate memory.";

/* errSecNotAvailable */
"-25291" = "No keychain is available. You may need to restart your computer.";

/* errSecReadOnly */
"-25292" = "This keychain cannot be modified.";

/* errSecAuthFailed */
"-25293" = "The user name or passphrase you entered is not correct.";

/* errSecNoSuchKeychain */
"-25294" = "The specified keychain could not be found.";

/* errSecInvalidKeychain */
"-25295" = "The specified keychain is not a valid keychain file.";

/* errSecDuplicateKeychain */
"-25296" = "A keychain with the same name already exists.";

/* errSecDuplicateCallback */
"-25297" = "The specified callback function is already installed.";

/* errSecInvalidCallback */
"-25298" = "The specified callback function is not valid.";

/* errSecDuplicateItem */
"-25299" = "The specified item already exists in the keychain.";

/* errSecItemNotFound */
"-25300" = "The specified item could not be found in the keychain.";

/* errSecBufferTooSmall */
"-25301" = "There is not enough memory available to use the specified item.";

/* errSecDataTooLarge */
"-25302" = "This item contains information which is too large or in a format that cannot be displayed.";

/* errSecNoSuchAttr */
"-25303" = "The specified attribute does not exist.";

/* errSecInvalidItemRef */
"-25304" = "The specified item is no longer valid. It may have been deleted from the keychain.";

/* errSecInvalidSearchRef */
"-25305" = "Unable to search the current keychain.";

/* errSecNoSuchClass */
"-25306" = "The specified item does not appear to be a valid keychain item.";

/* errSecNoDefaultKeychain */
"-25307" = "A default keychain could not be found.";

/* errSecInteractionNotAllowed */
"-25308" = "User interaction is not allowed.";

/* errSecReadOnlyAttr */
"-25309" = "The specified attribute could not be modified.";

/* errSecWrongSecVersion */
"-25310" = "This keychain was created by a different version of the system software and cannot be opened.";

/* errSecKeySizeNotAllowed */
"-25311" = "This item specifies a key size which is too large.";

/* errSecNoStorageModule */
"-25312" = "A required component (data storage module) could not be loaded. You may need to restart your computer.";

/* errSecNoCertificateModule */
"-25313" = "A required component (certificate module) could not be loaded. You may need to restart your computer.";

/* errSecNoPolicyModule */
"-25314" = "A required component (policy module) could not be loaded. You may need to restart your computer.";

/* errSecInteractionRequired */
"-25315" = "User interaction is required, but is currently not allowed.";

/* errSecDataNotAvailable */
"-25316" = "The contents of this item cannot be retrieved.";

/* errSecDataNotModifiable */
"-25317" = "The contents of this item cannot be modified.";

/* errSecCreateChainFailed */
"-25318" = "One or more certificates required to validate this certificate cannot be found.";

/* errSecInvalidPrefsDomain */
"-25319" = "The specified preferences domain is not valid.";

/* errSecACLNotSimple */
"-25240" = "The specified access control list is not in standard (simple) form.";

/* errSecPolicyNotFound */
"-25241" = "The specified policy cannot be found.";

/* errSecInvalidTrustSetting */
"-25242" = "The specified trust setting is invalid.";

/* errSecNoAccessForItem */
"-25243" = "The specified item has no access control.";

/* errSecInvalidOwnerEdit */
"-25244" = "Invalid attempt to change the owner of this item.";

/* errSecTrustNotAvailable */
"-25245" = "No trust results are available.";

/* errSecUnsupportedFormat */
"-25256" = "Import/Export format unsupported.";

/* errSecUnknownFormat */
"-25257" = "Unknown format in import.";

/* errSecKeyIsSensitive */
"-25258" = "Key material must be wrapped for export.";

/* errSecMultiplePrivKeys */
"-25259" = "An attempt was made to import multiple private keys.";

/* errSecPassphraseRequired */
"-25260" = "Passphrase is required for import/export.";

/* errSecInvalidPasswordRef */
"-25261" = "The password reference was invalid.";

/* errSecInvalidTrustSettings */
"-25262" = "The Trust Settings Record was corrupted.";

/* errSecNoTrustSettings */
"-25263" = "No Trust Settings were found.";

/* errSecPkcs12VerifyFailure */
"-25264" = "MAC verification failed during PKCS12 Import.";

/* errSecDecode */
"-26275" = "Unable to decode the provided data.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "CSP Vector of Buffers Error Values.";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "CSP Cryptographic Context Error Values.";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "CSP Staged Cryptographic API Error Values.";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* An attempt was made to use a public key which is incomplete due to * the lack of algorithm-specific parameters.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "a code signature match failed";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "Key StartDate/EndDate invalid";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "Keychain Syncing error codes";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "SSLv2 padding check: rollback attack detected";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "The OpenParameters argument passed to CSSM_DL_DbCreate or CSSM_DL_DbOpen was neither NULL nor a pointer to a valid CSSM_APPLEDL_OPEN_PARAMETERS structure.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "an operation failed because the disk was full";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "an operation failed because a disk quota was exceeded";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "an operation failed because a file was too large";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "a keychain database's internal information (\"blob\") is invalid";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "the internal data format version for a database's internal information (\"blob\") is invalid";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Host name mismatch";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Non-understood extension with Critical flag true";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Basic Constraints extension required per policy, but not present";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "Invalid BasicConstraints.CA";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "Invalid Authority Key ID";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "Invalid Subject Key ID";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Invalid Key Usage for policy";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Invalid Extended Key Usage for policy";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Invalid Subject/Authority Key ID Linkage";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "PathLengthConstraint exceeded";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Cert group terminated at a root cert which did not self-verify";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL expired/not valid yet";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "Cannot find appropriate CRL";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "specified CRL server down";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "illegible CRL distribution point URL";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Unknown critical cert/CRL extension";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "CRL not verifiable to anchor or root";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL verified to untrusted root";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "CRL failed policy verification";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "IssuingDistributionPoint extension violation";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Cert not found at specified issuerAltName";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Bad cert obtained from specified issuerAltName";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "S/MIME Email address mismatch";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "Appropriate S/MIME ExtendedKeyUsage not found";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "S/MIME KeyUsage incompatiblity";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, cert with KeyUsage flagged !critical";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, leaf with empty subject name and no email addrs * in SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, leaf with empty subject name, SubjectAltName * not critical";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "Appropriate SSL ExtendedKeyUsage not found";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "unparseable OCSP response";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "unparseable OCSP request";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "OCSP service unavailable";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "OCSP status: cert unrecognized";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "revocation check not successful for each cert";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "general network error";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "OCSP response not verifiable to anchor or root";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "OCSP response verified to untrusted root";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "OCSP response signature error";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "No signer for OCSP response found";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "OCSP responder status: malformed request";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "OCSP responder status: internal error";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "OCSP responder status: try later";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "OCSP responder status: signature required";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "OCSP responder status: unauthorized";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "OCSP response nonce did not match request";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "Illegal cert chain length for Code Signing";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Missing Basic Constraints for Code Signing";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "Bad PathLengthConstraint for Code Signing";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "Missing ExtendedKeyUsage for Code Signing";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Development style Code Signing Cert Detected";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "Illegal cert chain length for Resource Signing";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "bad extended key usage for Resource Signing";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Trust Setting: deny";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "invalid empty SubjectName";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "unknown critical Qualified Cert Statement ID";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "cert request queued";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "cert request redirected";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "general server-reported error";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "server-reported parameter error";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "server-reported authorization error";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "server-reported unimplemented";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "server-reported not available";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "server-reported already exists";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "server-reported service error";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "request already pending for specified user";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "no request pending for specified user";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "CSR failed to verify";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "server reported failed consistency check";

/* errSecCSUnimplemented */
"-67072" = "unimplemented code signing feature";

/* errSecCSInvalidObjectRef */
"-67071" = "invalid API object reference";

/* errSecCSInvalidFlags */
"-67070" = "invalid or inapprpopriate API flag(s) specified";

/* errSecCSObjectRequired */
"-67069" = "a required pointer argument was NULL";

/* errSecCSStaticCodeNotFound */
"-67068" = "cannot find code object on disk";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "cannot locate guests using this attribute set";

/* errSecCSInvalidAttributeValues */
"-67066" = "given attribute values are invalid";

/* errSecCSNoSuchCode */
"-67065" = "host has no guest with the requested attributes";

/* errSecCSMultipleGuests */
"-67064" = "host has multiple guests with this attribute value";

/* errSecCSGuestInvalid */
"-67063" = "code identity has been invalidated";

/* errSecCSUnsigned */
"-67062" = "code object is not signed";

/* errSecCSSignatureFailed */
"-67061" = "code or signature modified";

/* errSecCSSignatureNotVerifiable */
"-67060" = "signature cannot be read, e.g., due to a filesystem that maps root to an unprivileged user";

/* errSecCSSignatureUnsupported */
"-67059" = "unsupported type or version of signature";

/* errSecCSBadDictionaryFormat */
"-67058" = "a required plist file or resource is malformed";

/* errSecCSResourcesNotSealed */
"-67057" = "resources are not sealed by signature";

/* errSecCSResourcesNotFound */
"-67056" = "cannot find sealed resources in code";

/* errSecCSResourcesInvalid */
"-67055" = "the sealed resource directory is invalid";

/* errSecCSBadResource */
"-67054" = "a sealed resource is missing or invalid";

/* errSecCSResourceRulesInvalid */
"-67053" = "invalid resource selection rule(s)";

/* errSecCSReqInvalid */
"-67052" = "invalid or corrupted code requirement(s)";

/* errSecCSReqUnsupported */
"-67051" = "unsupported type or version of code requirement(s)";

/* errSecCSReqFailed */
"-67050" = "failed to satisfy code requirement(s)";

/* errSecCSBadObjectFormat */
"-67049" = "object file format invalid or unsuitable";

/* errSecCSInternalError */
"-67048" = "internal error in Code Signing subsystem";

/* errSecCSHostReject */
"-67047" = "code rejected its host";

/* errSecCSNotAHost */
"-67046" = "this code is not a host";

/* errSecCSSignatureInvalid */
"-67045" = "invalid format for signature";

/* errSecCSHostProtocolRelativePath */
"-67044" = "host protocol violation - absolute guest path required";

/* errSecCSHostProtocolContradiction */
"-67043" = "host protocol violation - contradictory hosting modes";

/* errSecCSHostProtocolDedicationError */
"-67042" = "host protocol violation - operation not allowed with/for a dedicated guest";

/* errSecCSHostProtocolNotProxy */
"-67041" = "host protocol violation - proxy hosting not engaged";

/* errSecCSHostProtocolStateError */
"-67040" = "host protocol violation - invalid guest state change request";

/* errSecCSHostProtocolUnrelated */
"-67039" = "host protocol violation - the given guest is not a guest of the given host";

/* errSecCSInvalidOperation */
"-67038" = "requested operation is not valid";

/* errSecCSNotSupported */
"-67037" = "operation not supported for this type of code";

/* errSecCSCMSTooLarge */
"-67036" = "signature too large to embed";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "host protocol violation - invalid guest hash";

/* errSecCSStaticCodeChanged */
"-67034" = "the program on disk does not match what is running";

/* errSecCSSigDBDenied */
"-67033" = "access to signature database denied";

/* errSecCSSigDBAccess */
"-67032" = "cannot access signature database";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "host returned invalid or inconsistent guest attributes";

/* errSecMisc_dskFulErr */
"-34" = "The disk is full.";

/* errSecMisc_nsvErr */
"-35" = "The disk couldn't be found. It may have been ejected.";

/* errSecMisc_bdNamErr */
"-37" = "Tried to open a file whose name contains an illegal character.";

/* errSecMisc_fnfErr */
"-43" = "The file could not be found.";

/* errSecMisc_wPrErr */
"-44" = "The disk is write-protected.";

/* errSecMisc_fLckdErr */
"-45" = "The file is locked.";

/* errSecMisc_vLckdErr */
"-46" = "The volume is locked.";

/* errSecMisc_fBsyErr */
"-47" = "The file is busy. It may be in use by another application.";

/* errSecMisc_dupFNErr */
"-48" = "A file with the same name already exists.";

/* errSecMisc_opWrErr */
"-49" = "The file is already open with write permission.";

/* errSecMisc_volOffLinErr */
"-53" = "The volume is no longer available. It may have been ejected.";

/* errSecMisc_permErr */
"-54" = "The file could not be opened. It may be in use by another application.";

/* errSecMisc_extFSErr */
"-58" = "This volume does not appear to be compatible.";

/* errSecMisc_wrPermErr */
"-61" = "Could not write to the file. It may have been opened with insufficient access privileges.";

/* errSecMisc_offLinErr */
"-65" = "The storage device is no longer available. It may have been ejected.";

/* errSecMisc_dirNFErr */
"-120" = "The directory could not be found.";

/* errSecMisc_volGoneErr */
"-124" = "The server volume is no longer available. It may have been disconnected.";

/* errSecMisc_userCanceledErr */
"-128" = "The operation was cancelled by the user.";

/* errSecMisc_resNotFound */
"-192" = "A required resource could not be found.";

/* errSecMisc_resFNotFound */
"-193" = "A required resource is missing or damaged.";

/* errSecMisc_icNoURLErr */
"-673" = "The specified location (URL) is an unknown type, or does not contain enough information.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "A helper application to open the specified URL could not be found.";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "The location (URL) of this item is missing or improperly formatted.";

/* errSecMisc_afpAccessDenied */
"-5000" = "Access to this item was denied.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "Authentication failed. The password for this server may have changed since the item was added to the keychain.";

